[{"model": "materials.material", "pk": 1, "fields": {"title": "Аналитическая геометрия", "body": "Аналити́ческая геоме́трия — раздел геометрии, в котором геометрические фигуры и их свойства исследуются средствами алгебры.\r\n\r\nВ основе этого метода лежит так называемый метод координат, впервые применённый Декартом в 1637 году. Каждому геометрическому соотношению этот метод ставит в соответствие некоторое уравнение, связывающее координаты фигуры или тела. Такой метод «алгебраизации» геометрических свойств доказал свою универсальность и плодотворно применяется во многих естественных науках и в технике[. В математике аналитическая геометрия является также основой для других разделов геометрии — дифференциальной, алгебраической, комбинаторной и вычислительной геометрии."}}, {"model": "materials.material", "pk": 2, "fields": {"title": "Математический анализ", "body": "Математи́ческий ана́лиз (классический математический анализ) — совокупность разделов математики,который объединяет дифференциальное и интегральное исчисления.\r\n\r\nНа классическом математическом анализе основывается современный анализ, который рассматривается как одно из трёх основных направлений математики (наряду с алгеброй и геометрией). При этом термин «математический анализ» в классическом понимании используется, в основном, в учебных программах и материалах. В англо-американской традиции классическому математическому анализу соответствуют программы курсов с наименованием «исчисление»"}}, {"model": "materials.material", "pk": 3, "fields": {"title": "Дискретная математика", "body": "Дискре́тная матема́тика — неклассифицируемое объединение нескольких разделов математики, изучающее дискретные математические структуры, такие как графы и утверждения в логике.\r\n\r\nВ контексте математики в целом дискретная математика часто отождествляется с конечной математикой — направлением, изучающим конечные структуры — конечные графы, конечные группы, конечные автоматы. Конечность определяет некоторые особенности, не присущие разделам, работающим с бесконечными и непрерывными структурами, например, в дискретных направлениях как правило обширнее класс разрешимых задач, так как во многих случаях возможен полный перебор вариантов, тогда как при работе с бесконечными и непрерывными структурами для разрешимости обычно требуются существенные ограничения. В связи с этим в дискретной математике особо важную роль играют задачи построения конкретных алгоритмов, и в том числе, эффективных с точки зрения вычислительной сложности. Ещё одна особенность дискретной математики — невозможность применения для её экстремальных задач техник анализа, существенно использующих недоступные для дискретных структур понятия гладкости. Поднаправление анализа, не использующее понятия непрерывности и предела и нацеленное на получение целочисленных результатов — дискретный анализ — считается частью дискретной математики, и иногда даже целиком с ней отождествляется. В целом можно считать, что дискретная математика охватывает значительные части алгебры, теории чисел, математической логики."}}, {"model": "materials.material", "pk": 4, "fields": {"title": "Топология", "body": "Тополо́гия — раздел математики, изучающий:\r\n1) в самом общем виде — явление непрерывности;\r\n2)в частности — свойства пространств, которые остаются неизменными при непрерывных деформациях. Например, связность, ориентируемость, компактность.\r\n\r\nВ отличие от геометрии, в топологии не рассматриваются метрические свойства объектов (например, расстояние между парой точек). Например, с точки зрения топологии кружка с ручкой и бублик (полноторий) неотличимы. При этом часто топология применяется к объектам, далёким от геометрических."}}, {"model": "materials.material", "pk": 6, "fields": {"title": "Теория функций комплексного переменного", "body": "Тео́рия фу́нкций ко́мпле́ксного переме́нного (или ко́мпле́ксной переме́нной; сокращенно — ТФКП) — раздел математического анализа, в котором рассматриваются и изучаются функции комплексного аргумента. \r\n\r\nКаждая комплексная функция w=f(z)=f(x+y*i) может рассматриваться как пара вещественных функций от двух переменных: f(z) = u(x,y) + i*v(x,y) определяющих её вещественную и мнимую часть соответственно. Функции (u,v) называются компонентами комплексной функции f(z)."}}]